ХМНПФ_Общее/DataProcessors/уп_РасчетЗакрытияДоговора_Основной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РасчетЗакрытияДоговора_Основной</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПенсионныеПравила.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПенсионныеПравила</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Правопреемники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредоставлятьСоциальныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсегдаНачислятьЗаПолныйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РассчитыватьОУДПриЗачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводноОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоТипамСумм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписыватьТипыСуммПропорционально</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДФЛПравопреемниковОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНомеровДоговоровОПСГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Корректировать51СчетПоВидамДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСклонятьФИОВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетИДОПСпоПриказуФСФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСписыватьИДРасторженцевОПСПриНачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетНачисленияИДПриЗакрытии</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОпределениеКоличестваВыплат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПечататьФИОВЗаявлениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьСредстваУмершихДоВступленияВДействие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МетодРасчетаРазмещенногоПРДляДекларации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНумерацииДоговоров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянийПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПараметрыПенсионногоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПараметрыПенсионногоДоговора</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ВидыРасторжения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВидыРасторжения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоСмерти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Досрочное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходВДругойНПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорВыполнен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_РасчетЗакрытияДоговора_Основной/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("Рассчитать")
Процедура ХМРассчитать()
	ИмяМодуляРасчетВыкупных = уп_НПОСервер.ПолучитьИмяМодуляРасчетВыкупных();
	Если ИмяМодуляРасчетВыкупных<>Неопределено Тогда
		МодульРасчетаВыкупных = ОбщегоНазначения.ОбщийМодуль(ИмяМодуляРасчетВыкупных);
		МодульРасчетаВыкупных.РасчетЗакрытияДоговора_Основной(ЭтотОбъект);
	Иначе //типовой механизм
		//формируем ТЗ
		
		//Отбор остатков
		ДатаНачалаВеденияУчетаПоСхемам = Константы.уп_УчетРезерваНПОвРазрезеСхем.Получить();
		Если ЗначениеЗаполнено(ДатаНачалаВеденияУчетаПоСхемам) И ДатаНачалаВеденияУчетаПоСхемам<=ДатаДок Тогда
			ВестиУчетПоСхемам = Истина;
		Иначе
			ВестиУчетПоСхемам = Ложь;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РезервыОстатки.НомерСчета КАК НомерСчета,
		|	РезервыОстатки.ТипРезерва КАК ТипРезерва,
		|	РезервыОстатки.ТипСуммы КАК ТипСуммы,
		|	ЕСТЬNULL(РезервыОстатки.СуммаОстаток, 0) КАК Сумма,
		|	РезервыОстатки.ПенсионнаяСхема КАК ПенсионнаяСхема,
		|	ЕСТЬNULL(уп_ИнвестДоходНПОКФиксацииОстатки.СуммаОстаток, 0) КАК СуммаНезафиксированногоИД
		|ИЗ
		|	РегистрНакопления.уп_Резервы.Остатки(
		|			&МомВремени,
		|			НомерСчета = &НомерСчета
		|				И ТипРезерва В (&СписокТиповРезерва)) КАК РезервыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ИнвестДоходНПОКФиксации.Остатки(&МомВремени, НомерСчета = &НомерСчета) КАК уп_ИнвестДоходНПОКФиксацииОстатки
		|		ПО РезервыОстатки.НомерСчета = уп_ИнвестДоходНПОКФиксацииОстатки.НомерСчета
		|			И РезервыОстатки.ТипРезерва = уп_ИнвестДоходНПОКФиксацииОстатки.ТипРезерва
		|			И РезервыОстатки.ТипСуммы = уп_ИнвестДоходНПОКФиксацииОстатки.ТипСуммы
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСчета";
		
		
		Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
		Запрос.УстановитьПараметр("МомВремени", ДатаЗакрытия-1);
#Вставка
		//Начисление проводится первым числом месяца начислений, иначе НДФЛ пойдет в прошлый месяц
		//25 была создана проводка на 01+t
		//28 начислеям остатки, без учета даты
		//УБРАТЬ ДАТУ ИЗ ЗАПРОСА Запрос.УстановитьПараметр("МомВремени", ДатаЗакрытия-1);
		//ОБЯЗАТЕЛЬНЫЙ АНАЛИЗ ОБОРОТОВ ПОСЛЕ ЗАКРЫТИЯ
		//ОТДЕЛЬНАЯ ГАЛОЧКА - 
		//ЧЕМ ОТЛИЧАЕТСЯ выплатной реестр на почте в периоды
		//с 25 по 28
		//с 28 и до платежного дня
		//с платежного дня (дата проведенеия документа)
        //27 - реестр сформирован, но не передан на почту
		//ФАКТ НЕИЗМЕННОСТИ БУДУЩИХ ПРОВОДОК - статус фактической оплаты
		//--ДЛЯ ПОЧТЫ ЭТО ГАЛОЧКА В ДОКУМЕНТЕ ОПИСИ
		//--ДЛЯ БАНКА ЭТО ПЛАТЕЖНОЕ ПОРУЧЕНИЕ
		//При остутствии факта потребуется откатить три документа:
		//--начилсение, начисление НДФЛ и регистрация выплат.
		//--удаляем счет
		//--проводим заново
#КонецВставки		
		СписокТиповРезерва = Новый СписокЗначений;
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ИПС);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.СПС);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ПожизненныхВыплат);
#Вставка
		//РезервНачисленийПенсийСПС
		//РезервНачисленийПенсийИПС
		//РезервНачисленийПенсийПожизненныхВыплат
		//МЫ ДОЛЖНЫ ПЕРЕНЕСТИ ОСТАТКИ  -нужно проверить и протестировать
#КонецВставки		
		Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва); 
		ТЗ = Запрос.Выполнить().Выгрузить();
		ТЗ.Колонки.Добавить("ИнвестДоход", Новый ОписаниеТипов("Число") );
		
		ЕстьРегистрирующийДокумент = Ложь;	
		Если ТипЗнч(РасчетныйДокумент) = Тип("ДокументСсылка.уп_ЗакрытиеСчетов") Тогда
			Если ЗначениеЗаполнено(РасчетныйДокумент.РегистрирующийДокумент) Тогда
				ЕстьРегистрирующийДокумент = Истина;
				РегистрирующийДокумент = РасчетныйДокумент.РегистрирующийДокумент;
			КонецЕсли;
		ИначеЕсли ТипЗнч(РасчетныйДокумент) = Тип("ДокументСсылка.уп_РасчетВыкупнойСуммыПоУмершим") Тогда
			Если ЗначениеЗаполнено(РасчетныйДокумент.ДокументОснование) Тогда
				ЕстьРегистрирующийДокумент = Истина;
				РегистрирующийДокумент = РасчетныйДокумент.ДокументОснование;
			КонецЕсли;
		КонецЕсли;
		
		ИмяМодуляРасчетаИД = уп_НПОСервер.ПолучитьИмяМодуляРасчетаИД(); 
		МодульРасчетаИД = ОбщегоНазначения.ОбщийМодуль(ИмяМодуляРасчетаИД);
		
		//начисление инвест дохода
		Если НачислитьДоход Тогда
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("Организация",РасчетныйДокумент.Организация);
			ПараметрыЗапроса.Вставить("Ссылка",РасчетныйДокумент);
			ПараметрыЗапроса.Вставить("НомерСчета",НомерСчета);
			ПараметрыЗапроса.Вставить("Схема",Схема);
			ПараметрыЗапроса.Вставить("ПроцентДохода",Ставка);
			ПараметрыЗапроса.Вставить("НачалоПериода",ДатаНачала);
			ПараметрыЗапроса.Вставить("ДнейВГодуВсего",ДнейВГоду);
			ПараметрыЗапроса.Вставить("Дата",ДатаДок);
			ПараметрыЗапроса.Вставить("КонецПериода",КонецДня(ДатаКонца));
			ПараметрыЗапроса.Вставить("ДнейВГоду",ДнейВГоду);
			ПараметрыЗапроса.Вставить("ЕстьРегистрирующийДокумент",ЕстьРегистрирующийДокумент);
			ПараметрыЗапроса.Вставить("РегистрирующийДокумент",РегистрирующийДокумент);
			
			МодульРасчетаИД.НачислитьИДЗакрытиеДоговора(ТЗ,ПараметрыЗапроса);
			
		КонецЕсли;
		
		ИтогоНаСчете = ТЗ.Итог("Сумма")+ТЗ.Итог("ИнвестДоход");
		
		//если это расторжение в период охлаждения, то КВС = 1
		РасторжениеВПериодОхлаждения = Ложь;
		Если ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное  Тогда
			Если ЕстьРегистрирующийДокумент Тогда  //это закрытие и делается на основании заявления
				СтрЗаявления = РегистрирующийДокумент.СписокСчетов.Найти(НомерСчета, "НомерСчета");
				Если СтрЗаявления<>Неопределено Тогда
					Если СтрЗаявления.РасторжениеВПериодОхлаждения Тогда
						РасторжениеВПериодОхлаждения = Истина;
					КонецЕсли;	
				КонецЕсли;
			Иначе //это доначисление и надо искать на льготрых условиях было расторжение или нет	
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.Ссылка КАК Ссылка,
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.НомерСчета КАК НомерСчета,
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.РасторжениеВПериодОхлаждения КАК РасторжениеВПериодОхлаждения,
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.ДатаОкончанияПериодаОхлаждения КАК ДатаОкончанияПериодаОхлаждения
				|ИЗ
				|	Документ.уп_ЗаявлениеУчастникаОРасторженииНПО.СписокСчетов КАК уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов
				|ГДЕ
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.НомерСчета = &НомерСчета
				|	И уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.Ссылка.Проведен = ИСТИНА
				|	И уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.Ссылка.Дата <= &ДатаРасчета
				|
				|УПОРЯДОЧИТЬ ПО
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.Ссылка.Дата УБЫВ";
				
				Запрос.УстановитьПараметр("ДатаРасчета", ДатаЗакрытия);
				Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					Если ВыборкаДетальныеЗаписи.РасторжениеВПериодОхлаждения Тогда
						РасторжениеВПериодОхлаждения = Истина;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//теперь надо определить коэффициент выкупной стоимости
		Если РасторжениеВПериодОхлаждения Тогда
			КВС = 1;
		Иначе
			КВС = РегистрыСведений.уп_КоэффициентВыкупнойСтоимости.ПолучитьПоследнее(ДатаДок, Новый Структура("ПенсионныйДоговор",НомерСчета.Владелец)).Коэффициент;
		КонецЕсли;
		//найдем сумму на ИПС - взносы физ.лиц
		ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(ДатаДок, Новый Структура("Организация", РасчетныйДокумент.Организация));	
		ТабТиповСумм = ТЗ.Скопировать();
		ТабТиповСумм.Свернуть("ТипСуммы", "Сумма");	
		//стр = ТЗ.Найти(Справочники.уп_ТипыСумм.ВзносыФиз,"ТипСуммы");
		стр = ТабТиповСумм.Найти(Справочники.уп_ТипыСумм.ВзносыФиз,"ТипСуммы");
		Если стр<>Неопределено Тогда
			СуммаИПСФиз = стр.Сумма;
		Иначе
			СуммаИПСФиз = 0;
		КонецЕсли;
		Если КВС>0 Тогда
			СуммаКВыплате = МАКС(СуммаИПСФиз,КВС*ИтогоНаСчете);
		Иначе
			СуммаКВыплате = ИтогоНаСчете;
		КонецЕсли;
		
		СуммаКВычитанию = ИтогоНаСчете-СуммаКВыплате;
		Если СуммаКВычитанию>0 Тогда
			Если СуммаКВыплате = СуммаИПСФиз Тогда
				КоэфВычитания = 1;
			Иначе
				КоэфВычитания = СуммаКВычитанию/(ИтогоНаСчете-СуммаИПСФиз);
			КонецЕсли;
		Иначе
			КоэфВычитания = 0;
		КонецЕсли;	
		
		//формируем ТЗРаспределение
		ТЗРаспределение.Колонки.Очистить();  //ТЗРаспределение = ТЗ.Скопировать();
		ТЗРаспределение.Колонки.Добавить("НомерСчета");
		ТЗРаспределение.Колонки.Добавить("ТипРезерва");
		ТЗРаспределение.Колонки.Добавить("ТипСуммы");
		ТЗРаспределение.Колонки.Добавить("ПенсионнаяСхема");
		ТЗРаспределение.Колонки.Добавить("СуммаНаСчете", Новый ОписаниеТипов("Число"));
		ТЗРаспределение.Колонки.Добавить("СуммаМГД", Новый ОписаниеТипов("Число") );   
		ТЗРаспределение.Колонки.Добавить("СуммаВыкупная", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаВНачале", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаВКонце", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаСтраховая", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаДоговора", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаВкладчика", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("ОблагаетсяНДФЛ");
		ТЗРаспределение.Колонки.Добавить("ИнвестДоход", Новый ОписаниеТипов("Число") );
		ТЗРаспределение.Колонки.Добавить("СуммаИДИзлишняя", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаНезафиксированногоИД", Новый ОписаниеТипов("Число") ); 
		
		ТекСхема = Схема;
		Если ЕстьРегистрирующийДокумент Тогда
			Состояние = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(РегистрирующийДокумент.Дата-1, Новый Структура("Номерсчета", Номерсчета)).Состояние;
		Иначе
			Состояние = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(РасчетныйДокумент.Дата-1, Новый Структура("Номерсчета", Номерсчета)).Состояние;
		КонецЕсли;
		Если Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены 
			ИЛИ  Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены Тогда
			Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод;
		КонецЕсли;
		
		//получим шаблон договора и посмотрим, применяется ли по договору СПТ
		Договор = НомерСчета.Владелец;
		Если ЕстьРегистрирующийДокумент Тогда
			ШаблонДоговора = РегистрыСведений.уп_ПараметрыПенсионногоДоговора.ПолучитьПоследнее(РегистрирующийДокумент.Дата-1, Новый Структура("ПенсионныйДоговор", Договор)).ШаблонДоговора;
		Иначе
			ШаблонДоговора = РегистрыСведений.уп_ПараметрыПенсионногоДоговора.ПолучитьПоследнее(РасчетныйДокумент.Дата-1, Новый Структура("ПенсионныйДоговор", Договор)).ШаблонДоговора;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ШаблонДоговора) Тогда 
			ПоДоговоруИспользуетсяСПТ =  ШаблонДоговора.ИспользоватьСПТ;
		Иначе
			ПоДоговоруИспользуетсяСПТ = ЛОЖЬ;
		КонецЕсли;
		
		Если ЕстьРегистрирующийДокумент Тогда
			лНаличиеСПТ = РегистрыСведений.уп_ПенсионныеCчетаCСПТ.ПолучитьПоследнее(РегистрирующийДокумент.Дата-1, Новый Структура("Номерсчета", Номерсчета)).НаличиеСПТ;
		Иначе
			лНаличиеСПТ = РегистрыСведений.уп_ПенсионныеCчетаCСПТ.ПолучитьПоследнее(РасчетныйДокумент.Дата-1, Новый Структура("Номерсчета", Номерсчета)).НаличиеСПТ;
		КонецЕсли;
		//тестовый вариант
		Для каждого стр из ТЗ цикл
			НовСтр = ТЗРаспределение.Добавить();
			НовСтр.НомерСчета = стр.НомерСчета;
			НовСтр.ТипРезерва = стр.ТипРезерва;
			НовСтр.ТипСуммы = стр.ТипСуммы;
			НовСтр.СуммаНаСчете = стр.Сумма;
			НовСтр.СуммаМГД = стр.ИнвестДоход;
			НовСтр.ПенсионнаяСхема = стр.ПенсионнаяСхема;  
			НовСтр.СуммаНезафиксированногоИД = стр.СуммаНезафиксированногоИД;
			Если РасторжениеВПериодОхлаждения Тогда
				НовСтр.СуммаВыкупная = стр.Сумма;
				НовСтр.СуммаВНачале = стр.Сумма;
			Иначе	
				Если (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВНакопительныйПериод) 
					или (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВНакопительныйПериод)
					или (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВНакопительныйПериод)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВНакопительныйПериод) 
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВНакопительныйПериод)
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВНакопительныйПериод)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериод)
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериод)
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериод)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериод)
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериод)
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериод) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериод)
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериод)
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериод) 
					
					//все тоже самое с СПТ
					или (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВНакопительныйПериодСПТ) 
					или (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВНакопительныйПериодСПТ)
					или (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВНакопительныйПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВНакопительныйПериодСПТ) 
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВНакопительныйПериодСПТ)
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВНакопительныйПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериодСПТ)
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериодСПТ)
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ)
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ)
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ)
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ)
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ) Тогда
					
					Если (КоэфВычитания>0) и (стр.ТипСуммы<>Справочники.уп_ТипыСумм.ВзносыФиз) Тогда
						НовСтр.СуммаВыкупная = (стр.Сумма+стр.ИнвестДоход)-Окр((стр.Сумма+стр.ИнвестДоход)*КоэфВычитания,2,1);
						НовСтр.СуммаВНачале = НовСтр.СуммаВыкупная;
					Иначе
						НовСтр.СуммаВыкупная = стр.Сумма;
						НовСтр.СуммаВНачале = стр.Сумма;
					КонецЕсли;
				Иначе  //все равно считаем, но обнуляем выкупную сумму
					НовСтр.СуммаВыкупная = 0;
					НовСтр.СуммаВНачале = 0;
				КонецЕсли;
			КонецЕсли;
			НовСтр.СуммаВКонце = 0;
			НовСтр.СуммаСтраховая = (НовСтр.СуммаНаСчете+НовСтр.СуммаМГД)-НовСтр.СуммаВыкупная;
			НовСтр.СуммаДоговора = 0;
			НовСтр.СуммаВкладчика = 0;
			Если ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти Тогда
				Если ПенсионныеПравила.НачислениеПоПравуНаследованияОблагаетсяНДФЛ Тогда
					НовСтр.ОблагаетсяНДФЛ = Истина;
				Иначе
					НовСтр.ОблагаетсяНДФЛ = Ложь;
				КонецЕсли;	
			ИначеЕсли ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ Тогда
				НовСтр.ОблагаетсяНДФЛ = Ложь; 
			ИначеЕсли РасторжениеВПериодОхлаждения Тогда 
				НовСтр.ОблагаетсяНДФЛ = Ложь; 
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ПенсионныеСхемыИсточникиВыплат_ИПС.ОблагаетсяНДФЛПриРасторжении КАК ОблагаетсяНДФЛ
				|ИЗ
				|	Справочник.уп_ПенсионныеСхемы.ИсточникиВыплат_ИПС КАК ПенсионныеСхемыИсточникиВыплат_ИПС
				|ГДЕ
				|	ПенсионныеСхемыИсточникиВыплат_ИПС.Ссылка = &ТекСхема
				|	И ПенсионныеСхемыИсточникиВыплат_ИПС.ТипРезерва = &ТипРезерва
				|	И ПенсионныеСхемыИсточникиВыплат_ИПС.ТипСуммы = &ТипСуммы";
				
				Запрос.УстановитьПараметр("ТекСхема", ТекСхема);
				Запрос.УстановитьПараметр("ТипРезерва", стр.ТипРезерва);
				Запрос.УстановитьПараметр("ТипСуммы", стр.ТипСуммы);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				Облагается = Истина;
				Пока Выборка.Следующий() Цикл
					Облагается = Выборка.ОблагаетсяНДФЛ;
					Прервать;
				КонецЦикла;
				НовСтр.ОблагаетсяНДФЛ = Облагается;
			КонецЕсли;	
		КонецЦикла;	
		
		//
		
		
		// Распределение по получетелям
		
		ТЗПолучатели = ТЗРаспределение.Скопировать();
	КонецЕсли;
КонецПроцедуры
